{
    "sites": [
        {
            "name": "Web Designer Depot",
            "desc": "Founded by web designer Walter Apai, it’s a collaboration between designers worldwide who contribute features, articles, and tutorials to help grow the design community.",
            "url": "https://www.webdesignerdepot.com/"
        },
        {
            "name": "DesignModo",
            "desc": "This site contains lots of informational articles and tools for designers and developers. Articles include information on web design, web development, WordPress, tips, tutorials, inspiration, etc.",
            "url": "https://designmodo.com/"
        },
        {
            "name": "CSS-Tricks",
            "desc": "Founded by Chris Coyier, this site originally covered CSS and now has a team of 11 that covers every aspect of web design and development.",
            "url": "https://css-tricks.com/"
        },
        {
            "name": "Hongkiat",
            "desc": "Since 2007 this site has produced articles, tutorials, recommended tools, tips and tricks, and more for designers, developers, techies, and bloggers.",
            "url": "https://www.hongkiat.com/blog/"
        },
        {
            "name": "Smashing Magazine",
            "desc": "Founded by Vitaly Friedman and Sven Lennartz, this site produces articles, tutorials, and more for designers and developers.",
            "url": "https://www.smashingmagazine.com/"
        },
        {
            "name": "Vandelay Design",
            "desc": "The focus of this site is to equip creatives, small business owners, and entrepreneurs with the tools to develop their business ideas. They have lots of articles on web design, writing, web development, and more.",
            "url": "https://www.vandelaydesign.com/"
        },
        {
            "name": "SpeckyBoy",
            "desc": "Paul Andrew launched this site in October 2007 as a personal freelance web design homepage. It’s now grown into a web design magazine. It has tons of tutorials, resources, time-saving techniques, and even inspirational art.",
            "url": "https://speckyboy.com/"
        },
        {
            "name": "A List Apart",
            "desc": "This site launched way back in 1998 by Jeffrey Zeldman. Articles focus on web design and are geared toward designers, developers, architects, specialists, strategists, project managers, and writers.",
            "url": "https://alistapart.com/"
        },
        {
            "name": "DesignShack",
            "desc": "This design website produces many articles that showcase inspiring web design. They also produce resources and tutorials. They focus on design and catalogue the greatest projects on the web.",
            "url": "https://designshack.net/"
        },
        {
            "name": "CreativeBloq",
            "desc": "This is a daily online magazine from FutureNet that produces articles about web design, graphic design, 3D, digital art, audiovisual, typography, branding, illustration, UX, logo design, branding, mobile, and more.",
            "url": "https://www.creativebloq.com/"
        },
        {
            "name": "Codrops",
            "desc": "This design blog is from freelance web designers and developers Manoela Ilic and Pedro Botelho.  It started as an experimental blog and became a place for sharing the passion for web design and web development. ",
            "url": "http://tympanus.net/codrops/"
        },
        {
            "name": "Design Taxi",
            "desc": "This is an online magazine that focuses on lots of areas in design – including furniture design. Design topics include logos, social media, illustration, photography, creativity, advertising, product design, typography, apps, and more.",
            "url": "https://designtaxi.com/"
        },
        {
            "name": "Abduzeedo",
            "desc": "Here’s a blog about design that has lots of articles for inspiration. It was founded in 2006 by Fabio Sasso and Fabiano Meneghetti. It has useful tutorials for the most used applications with a special attention to Photoshop and Illustrator",
            "url": "https://abduzeedo.com/"
        },
        {
            "name": "David Walsh",
            "desc": "This is the blog of JavaScript and HTML5 Consultant David Walsh. It contains lots of articles and tutorials that primarily focus on front-end technology.",
            "url": "https://davidwalsh.name/"
        },
        {
            "name": "The Ultralinx",
            "desc": "This is an online web magazine by Oliur Rahman that curates high quality content from around the web. It covers everything from technology to design.",
            "url": "http://theultralinx.com/"
        },
        {
            "name": "Design Beep",
            "desc": "This blog covers lots of topics on design and development. It includes articles, tutorials, tools, resources, freebies, and inspiration. It covers graphics, logos, typography, web design.",
            "url": "http://designbeep.com/"
        },
        {
            "name": "Line 25",
            "desc": "A blog based around the topic of web design. It was created by Chris Spooner and is maintained by Iggy. It contains many articles to give ideas and inspiration to web creatives.",
            "url": "https://line25.com/"
        },
        {
            "name": "Dev",
            "desc": "DEV is a community of 482,209 amazing developers. We're a place where coders share, stay up-to-date and grow their careers.",
            "url": "https://dev.to/"
        },
        {
            "name": "Alligator.IO",
            "desc": "With a deep love and appreciation for the web platform and the JavaScript ecosystem, Alligator.io has now grown to be a major source of knowledge for anybody who's interested in modern web development.",
            "url": "https://alligator.io/"
        }
    ]
}